In [3]:
pip install word2number

Collecting word2number
  Downloading word2number-1.1.zip (9.7 kB)
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py) ... done
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5566 sha256=a08845c724748126092ac2746accba681551c4fdda0a089ef7bfeb926fbf4193
  Stored in directory: /Users/youneshosseini/Library/Caches/pip/wheels/cd/ef/ae/073b491b14d25e2efafcffca9e16b2ee6d114ec5c643ba4f06
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1
Note: you may need to restart the kernel to use updated packages.

In [10]:
pip install -r requirements.txt

ERROR: Could not open requirements file: [Errno 2] No such file or directory: 'requirements.txt'
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd
import numpy as np
from sklearn import linear_model
from word2number import w2n

In [6]:
d = pd.read_csv('hiring.csv')
d

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [7]:
d.experience = d.experience.fillna('zero')

In [8]:
d

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1       zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [11]:
d.experience = d.experience.apply(w2n.word_to_number)

AttributeError: module 'word2number.w2n' has no attribute 'word_to_number'

In [16]:
print(w2n.word_to_number('two'))

AttributeError: module 'word2number.w2n' has no attribute 'word_to_number'